xml-them.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header>
      <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
         <wsse:BinarySecurityToken ValueType="ExperianWASP" EncodingType="wsse:Base64Binary" wsu:Id="SecurityToken">${Token#Binary Token}</wsse:BinarySecurityToken>
      </wsse:Security>
   </SOAP-ENV:Header>
   <SOAP-ENV:Body>
      <m:Interactive xmlns:m="http://www.uk.experian.com/experian/wbsv/peinteractive/v100">
         <n:Root xmlns:n="http://schemas.microsoft.com/BizTalk/2003/Any">
            <o:Input xmlns:o="http://schema.uk.experian.com/experian/cems/msgs/v2.0/ConsumerData">
               <Applicant>
                  <ApplicantIdentifier>1</ApplicantIdentifier>
                  <Gender/>
                  <Name>
                     <Title>MR</Title>
                     <Forename>KEVIN</Forename>
                     <MiddleName/>
                     <Surname>RHODES</Surname>
                     <Suffix/>
                  </Name>
                  <DateOfBirth>
                     <CCYY>1963</CCYY>
                     <MM>11</MM>
                     <DD>11</DD>
                  </DateOfBirth>
               </Applicant>
               <Application>
                  <ApplicationType>EQ</ApplicationType>
                  <MortgageType/>
                  <MonthlyAmount>1</MonthlyAmount>
                  <ApplicationChannel/>
                  <AuthenticationType/>
                  <ManualAuthReq/>
                  <SearchConsent>Y</SearchConsent>
               </Application>
               <ApplicationData>
                  <ApplicantIdentifier>1</ApplicantIdentifier>
                  <Personal>
                     <MaritalStatus/>
                     <MobileTelNumber/>
                     <Dependants/>
                     <ResidentialStatus/>
                     <EmailAddress/>
                     <NatInsuranceNum/>
                     <PassportNumber/>
                     <CountryOfBirth/>
                     <HomeTelephone>
                        <STDCode/>
                        <LocalNumber/>
                     </HomeTelephone>
                  </Personal>
                  <Bank>
                     <BankSortCode/>
                     <BankAccountNumber/>
                     <CurrentAccountHeld/>
                     <ChequeCardHeld/>
                     <TimeWithBank>
                        <Years/>
                        <Months/>
                     </TimeWithBank>
                  </Bank>
                  <Financial>
                  	 <GrossAnnualIncome>30000</GrossAnnualIncome>
                  </Financial>	 	
                  <Employment>
                     <EmployerName/>
                     <OccupationStatus/>
                     <EmploymentStatus/>
                     <WorkTelephone>
                        <STDCode/>
                        <LocalNumber/>
                     </WorkTelephone>
                     <TimeWithEmployer>
                        <Years/>
                        <Months/>
                     </TimeWithEmployer>
                  </Employment>
                  <Vehicle>
                     <DrivingLicenceNum/>
                     <VehicleRegistration/>
                  </Vehicle>
                  <Security>
                     <PlaceOfBirth/>
                     <MothersMaidenName/>
                     <BirthSurname/>
                  </Security>
               </ApplicationData>
               <Control>
                  <ClientAccountNumber>*****</ClientAccountNumber>
                  <ClientBranchNumber/>
                  <UserIdentity/>
                  <TestDatabase>A</TestDatabase>
                  <ProductCode>DelphiSelect</ProductCode>
                  <ClientRef/>
                  <JobNumber/>
                  <Parameters>
                     <InteractiveMode>OneShot</InteractiveMode>
                     <FullFBLRequired>Y</FullFBLRequired>
                     <AuthPlusRequired>N</AuthPlusRequired>
                     <DetectRequired>N</DetectRequired>
                  </Parameters>
               </Control>
               <LocationDetails>
                  <LocationIdentifier>1</LocationIdentifier>
                  <UKLocation>
                     <Flat/>
                     <HouseName/>
                     <HouseNumber>10</HouseNumber>
                     <Street>CREEL WYND</Street>
                     <Street2/>
                     <District/>
                     <PostTown>ABERDEEN</PostTown>
                     <County/>
                     <Postcode>AB123TD</Postcode>
                  </UKLocation>
               </LocationDetails>
               <Residency>
                  <ApplicantIdentifier>1</ApplicantIdentifier>
                  <LocationIdentifier>1</LocationIdentifier>
                  <LocationCode>01</LocationCode>
                  <ResidencyDateFrom>
                     <CCYY>2005</CCYY>
                     <MM>11</MM>
                     <DD>1</DD>
                  </ResidencyDateFrom>
                  <ResidencyDateTo>
                     <CCYY>2014</CCYY>
                     <MM>1</MM>
                     <DD>1</DD>
                  </ResidencyDateTo>
               </Residency>
               <ThirdPartyData>
                  <OptOut>N</OptOut>
                  <TransientAssocs>N</TransientAssocs>
                  <HHOAllowed/>
                  <OptoutValidCutOff>N</OptoutValidCutOff>
               </ThirdPartyData>
            </o:Input>
         </n:Root>
      </m:Interactive>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>